# Lecture11 - Pandas Basics

In [3]:
import pandas as pd 
import numpy as np

In [5]:
pd.__version__

'2.2.2'

<b> Series<b>

In [7]:
dict = {
            "one" : [1, 2, 3, 4]
}
dict

{'one': [1, 2, 3, 4]}

In [13]:
mylist = [1, 2, 3, 4]

In [19]:
my_arrary = np.array(mylist)

In [15]:
my_series_1 = pd.Series(mylist)

In [9]:
my_series = pd.Series(dict)

In [17]:
type(my_series_1)

pandas.core.series.Series

In [21]:
my_series.index

Index(['one'], dtype='object')

In [25]:
a1 = np.random.randint(5, size=5)
series1 = pd.Series(a1)

In [27]:
series1

0    4
1    2
2    2
3    0
4    1
dtype: int32

In [12]:
a1 = np.random.randint(5, size=5)
series1 = pd.Series(a1, index=['a', 'b', 'c', 'd', 'e'])
series1

a    4
b    3
c    1
d    3
e    1
dtype: int32

In [13]:
series1['a']

4

In [39]:
pd.Series(1.0, index=['a', 'b', 'c'])

a    1.0
b    1.0
c    1.0
dtype: float64

<b> Data Frame <b>

In [33]:
data = {
    "id" : [ 1, 2, 3, 4], 
    "name" : ["a", "b", "c", "d"]
}
data

{'id': [1, 2, 3, 4], 'name': ['a', 'b', 'c', 'd']}

In [35]:
df = pd.DataFrame(data)

In [37]:
df

   id name
0   1    a
1   2    b
2   3    c
3   4    d

In [41]:
type(df)

pandas.core.frame.DataFrame

In [45]:
df.columns

Index(['id', 'name'], dtype='object')

In [47]:
df.dtypes

id       int64
name    object
dtype: object

In [51]:
s1 = pd.Series([1, 2, 3, 4], name="id")
s2 = pd.Series(['a', 'b', 'c', 'd'], name="name")
s3 = pd.Series([True, False, False, True], name="working")
s4 = pd.Series([1.2, 3.4, 1, 4], name='exp')

In [53]:
serieses = [ s1, s2, s3, s4]
x = pd.DataFrame(serieses)
x

            0      1      2     3
id          1      2      3     4
name        a      b      c     d
working  True  False  False  True
exp       1.2    3.4    1.0   4.0

In [55]:
x.T

  id name working  exp
0  1    a    True  1.2
1  2    b   False  3.4
2  3    c   False  1.0
3  4    d    True  4.0

<b> Reading files <b>

In [59]:
students_df = pd.read_csv("students.csv")

In [61]:
students_df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   pawar      5      5          10       2       4
2   3     xyz      3      3           5      11      33
3   4     abc      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [63]:
type(students_df)

pandas.core.frame.DataFrame

In [65]:
help(pd.read_excel)

Help on function read_excel in module pandas.io.excel._base:

read_excel(io, sheet_name: 'str | int | list[IntStrT] | None' = 0, *, header: 'int | Sequence[int] | None' = 0, names: 'SequenceNotStr[Hashable] | range | None' = None, index_col: 'int | str | Sequence[int] | None' = None, usecols: 'int | str | Sequence[int] | Sequence[str] | Callable[[str], bool] | None' = None, dtype: 'DtypeArg | None' = None, engine: "Literal['xlrd', 'openpyxl', 'odf', 'pyxlsb', 'calamine'] | None" = None, converters: 'dict[str, Callable] | dict[int, Callable] | None' = None, true_values: 'Iterable[Hashable] | None' = None, false_values: 'Iterable[Hashable] | None' = None, skiprows: 'Sequence[int] | int | Callable[[int], object] | None' = None, nrows: 'int | None' = None, na_values=None, keep_default_na: 'bool' = True, na_filter: 'bool' = True, verbose: 'bool' = False, parse_dates: 'list | dict | bool' = False, date_parser: 'Callable | lib.NoDefault' = <no_default>, date_format: 'dict[Hashable, str] | str | None' = None, thousands: 'str | None' = None, decimal: 'str' = '.', comment: 'str | None' = None, skipfooter: 'int' = 0, storage_options: 'StorageOptions | None' = None, dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>, engine_kwargs: 'dict | None' = None) -> 'DataFrame | dict[IntStrT, DataFrame]'
    Read an Excel file into a ``pandas`` ``DataFrame``.

    Supports `xls`, `xlsx`, `xlsm`, `xlsb`, `odf`, `ods` and `odt` file extensions
    read from a local filesystem or URL. Supports an option to read
    a single sheet or a list of sheets.

    Parameters
    ----------
    io : str, bytes, ExcelFile, xlrd.Book, path object, or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, and file. For file URLs, a host is
        expected. A local file could be: ``file://localhost/path/to/table.xlsx``.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method,
        such as a file handle (e.g. via builtin ``open`` function)
        or ``StringIO``.

        .. deprecated:: 2.1.0
            Passing byte strings is deprecated. To read from a
            byte string, wrap it in a ``BytesIO`` object.
    sheet_name : str, int, list, or None, default 0
        Strings are used for sheet names. Integers are used in zero-indexed
        sheet positions (chart sheets do not count as a sheet position).
        Lists of strings/integers are used to request multiple sheets.
        Specify ``None`` to get all worksheets.

        Available cases:

        * Defaults to ``0``: 1st sheet as a `DataFrame`
        * ``1``: 2nd sheet as a `DataFrame`
        * ``"Sheet1"``: Load sheet with name "Sheet1"
        * ``[0, 1, "Sheet5"]``: Load first, second and sheet named "Sheet5"
          as a dict of `DataFrame`
        * ``None``: All worksheets.

    header : int, list of int, default 0
        Row (0-indexed) to use for the column labels of the parsed
        DataFrame. If a list of integers is passed those row positions will
        be combined into a ``MultiIndex``. Use None if there is no header.
    names : array-like, default None
        List of column names to use. If file contains no header row,
        then you should explicitly pass header=None.
    index_col : int, str, list of int, default None
        Column (0-indexed) to use as the row labels of the DataFrame.
        Pass None if there is no such column.  If a list is passed,
        those columns will be combined into a ``MultiIndex``.  If a
        subset of data is selected with ``usecols``, index_col
        is based on the subset.

        Missing values will be forward filled to allow roundtripping with
        ``to_excel`` for ``merged_cells=True``. To avoid forward filling the
        missing values use ``set_index`` after reading the data instead of
        ``index_col``.
    usecols : str, list-like, or callable, default None
        * If None, then parse all columns.
        * If str, then indicates comma separated list of Excel column letters
          and column ranges (e.g. "A:E" or "A,C,E:F"). Ranges are inclusive of
          both sides.
        * If list of int, then indicates list of column numbers to be parsed
          (0-indexed).
        * If list of string, then indicates list of column names to be parsed.
        * If callable, then evaluate each column name against it and parse the
          column if the callable returns ``True``.

        Returns a subset of the columns according to behavior above.
    dtype : Type name or dict of column -> type, default None
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32}
        Use ``object`` to preserve data as stored in Excel and not interpret dtype,
        which will necessarily result in ``object`` dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
        If you use ``None``, it will infer the dtype of each column based on the data.
    engine : {'openpyxl', 'calamine', 'odf', 'pyxlsb', 'xlrd'}, default None
        If io is not a buffer or path, this must be set to identify io.
        Engine compatibility :

        - ``openpyxl`` supports newer Excel file formats.
        - ``calamine`` supports Excel (.xls, .xlsx, .xlsm, .xlsb)
          and OpenDocument (.ods) file formats.
        - ``odf`` supports OpenDocument file formats (.odf, .ods, .odt).
        - ``pyxlsb`` supports Binary Excel files.
        - ``xlrd`` supports old-style Excel files (.xls).

        When ``engine=None``, the following logic will be used to determine the engine:

        - If ``path_or_buffer`` is an OpenDocument format (.odf, .ods, .odt),
          then `odf <https://pypi.org/project/odfpy/>`_ will be used.
        - Otherwise if ``path_or_buffer`` is an xls format, ``xlrd`` will be used.
        - Otherwise if ``path_or_buffer`` is in xlsb format, ``pyxlsb`` will be used.
        - Otherwise ``openpyxl`` will be used.
    converters : dict, default None
        Dict of functions for converting values in certain columns. Keys can
        either be integers or column labels, values are functions that take one
        input argument, the Excel cell content, and return the transformed
        content.
    true_values : list, default None
        Values to consider as True.
    false_values : list, default None
        Values to consider as False.
    skiprows : list-like, int, or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int) at the
        start of the file. If callable, the callable function will be evaluated
        against the row indices, returning True if the row should be skipped and
        False otherwise. An example of a valid callable argument would be ``lambda
        x: x in [0, 2]``.
    nrows : int, default None
        Number of rows to parse.
    na_values : scalar, str, list-like, or dict, default None
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values. By default the following values are interpreted
        as NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'None',
        'n/a', 'nan', 'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether ``na_values`` is passed in, the behavior is as follows:

        * If ``keep_default_na`` is True, and ``na_values`` are specified,
          ``na_values`` is appended to the default NaN values used for parsing.
        * If ``keep_default_na`` is True, and ``na_values`` are not specified, only
          the default NaN values are used for parsing.
        * If ``keep_default_na`` is False, and ``na_values`` are specified, only
          the NaN values specified ``na_values`` are used for parsing.
        * If ``keep_default_na`` is False, and ``na_values`` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the ``keep_default_na`` and
        ``na_values`` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing ``na_filter=False`` can improve the
        performance of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    parse_dates : bool, list-like, or dict, default False
        The behavior is as follows:

        * ``bool``. If True -> try parsing the index.
        * ``list`` of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * ``list`` of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * ``dict``, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index contains an unparsable date, the entire column or
        index will be returned unaltered as an object data type. If you don`t want to
        parse some cells as date just change their type in Excel to "Text".
        For non-standard datetime parsing, use ``pd.to_datetime`` after ``pd.read_excel``.

        Note: A fast-path exists for iso8601-formatted dates.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.

        .. deprecated:: 2.0.0
           Use ``date_format`` instead, or read in as ``object`` and then apply
           :func:`to_datetime` as-needed.
    date_format : str or dict of column -> format, default ``None``
       If used in conjunction with ``parse_dates``, will parse dates according to this
       format. For anything more complex,
       please read in as ``object`` and then apply :func:`to_datetime` as-needed.

       .. versionadded:: 2.0.0
    thousands : str, default None
        Thousands separator for parsing string columns to numeric.  Note that
        this parameter is only necessary for columns stored as TEXT in Excel,
        any numeric columns will automatically be parsed, regardless of display
        format.
    decimal : str, default '.'
        Character to recognize as decimal point for parsing string columns to numeric.
        Note that this parameter is only necessary for columns stored as TEXT in Excel,
        any numeric columns will automatically be parsed, regardless of display
        format.(e.g. use ',' for European data).

        .. versionadded:: 1.4.0

    comment : str, default None
        Comments out remainder of line. Pass a character or characters to this
        argument to indicate comments in the input file. Any data between the
        comment string and the end of the current line is ignored.
    skipfooter : int, default 0
        Rows at the end to skip (0-indexed).
    storage_options : dict, optional
        Extra options that make sense for a particular storage connection, e.g.
        host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
        are forwarded to ``urllib.request.Request`` as header options. For other
        URLs (e.g. starting with "s3://", and "gcs://") the key-value pairs are
        forwarded to ``fsspec.open``. Please see ``fsspec`` and ``urllib`` for more
        details, and for more examples on storage options refer `here
        <https://pandas.pydata.org/docs/user_guide/io.html?
        highlight=storage_options#reading-writing-remote-files>`_.

    dtype_backend : {'numpy_nullable', 'pyarrow'}, default 'numpy_nullable'
        Back-end data type applied to the resultant :class:`DataFrame`
        (still experimental). Behaviour is as follows:

        * ``"numpy_nullable"``: returns nullable-dtype-backed :class:`DataFrame`
          (default).
        * ``"pyarrow"``: returns pyarrow-backed nullable :class:`ArrowDtype`
          DataFrame.

        .. versionadded:: 2.0

    engine_kwargs : dict, optional
        Arbitrary keyword arguments passed to excel engine.

    Returns
    -------
    DataFrame or dict of DataFrames
        DataFrame from the passed in Excel file. See notes in sheet_name
        argument for more information on when a dict of DataFrames is returned.

    See Also
    --------
    DataFrame.to_excel : Write DataFrame to an Excel file.
    DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Notes
    -----
    For specific information on the methods used for each Excel engine, refer to the pandas
    :ref:`user guide <io.excel_reader>`

    Examples
    --------
    The file can be read using the file name as string or an open file object:

    >>> pd.read_excel('tmp.xlsx', index_col=0)  # doctest: +SKIP
           Name  Value
    0   string1      1
    1   string2      2
    2  #Comment      3

    >>> pd.read_excel(open('tmp.xlsx', 'rb'),
    ...               sheet_name='Sheet3')  # doctest: +SKIP
       Unnamed: 0      Name  Value
    0           0   string1      1
    1           1   string2      2
    2           2  #Comment      3

    Index and header can be specified via the `index_col` and `header` arguments

    >>> pd.read_excel('tmp.xlsx', index_col=None, header=None)  # doctest: +SKIP
         0         1      2
    0  NaN      Name  Value
    1  0.0   string1      1
    2  1.0   string2      2
    3  2.0  #Comment      3

    Column types are inferred but can be explicitly specified

    >>> pd.read_excel('tmp.xlsx', index_col=0,
    ...               dtype={'Name': str, 'Value': float})  # doctest: +SKIP
           Name  Value
    0   string1    1.0
    1   string2    2.0
    2  #Comment    3.0

    True, False, and NA values, and thousands separators have defaults,
    but can be explicitly specified, too. Supply the values you would like
    as strings or lists of strings!

    >>> pd.read_excel('tmp.xlsx', index_col=0,
    ...               na_values=['string1', 'string2'])  # doctest: +SKIP
           Name  Value
    0       NaN      1
    1       NaN      2
    2  #Comment      3

    Comment lines in the excel input file can be skipped using the
    ``comment`` kwarg.

    >>> pd.read_excel('tmp.xlsx', index_col=0, comment='#')  # doctest: +SKIP
          Name  Value
    0  string1    1.0
    1  string2    2.0
    2     None    NaN

In [67]:
df_excel = pd.read_excel("students.xlsx", sheet_name="marksheet")

In [68]:
df_excel

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

In [71]:
type(df_excel)

pandas.core.frame.DataFrame

<b> Writing to a file <b>

In [73]:
x.to_csv("my_dataframe.csv")

<b> Data Selection<b>

In [103]:
df

   id name
0   1    a
1   2    b
2   3    c
3   4    d

In [105]:
name = df["name"]

In [107]:
type(name)

pandas.core.series.Series

In [109]:
list_of_columns = [ "id", "name"]
extract = df[list_of_columns]

In [97]:
type(extract)

pandas.core.frame.DataFrame

In [111]:
extract

   id name
0   1    a
1   2    b
2   3    c
3   4    d

In [113]:
extract["name"]

0    a
1    b
2    c
3    d
Name: name, dtype: object

In [115]:
df

   id name
0   1    a
1   2    b
2   3    c
3   4    d

In [117]:
students_df.head(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   pawar      5      5          10       2       4

In [119]:
students_df.tail(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
3   4     abc      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [121]:
students_df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   pawar      5      5          10       2       4
2   3     xyz      3      3           5      11      33
3   4     abc      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [137]:
students_df.iloc[1, 1] # elements

'pawar'

In [147]:
students_df.iloc[0:1] # Rows and slicing

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34

In [65]:
df.iloc[0:2, 1:3]

     name  quiz1
0  pravin      5
1   pawar      5

In [145]:
students_df.loc[3]

id              4
name          abc
quiz1           5
quiz2           5
assignment      5
midsem         23
compre         11
Name: 3, dtype: object

In [67]:
df.loc[0, "id"]

1

In [149]:
df.loc[0:3, ["id", "name"]]

   id name
0   1    a
1   2    b
2   3    c
3   4    d

In [151]:
students_df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   pawar      5      5          10       2       4
2   3     xyz      3      3           5      11      33
3   4     abc      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [161]:
students_df[students_df.quiz1 > 3]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   pawar      5      5          10       2       4
3   4     abc      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [163]:
students_df["quiz1"]

0    5
1    5
2    3
3    5
4    5
Name: quiz1, dtype: int64

In [165]:
students_df.quiz1

0    5
1    5
2    3
3    5
4    5
Name: quiz1, dtype: int64

In [167]:
students_df[ (students_df.quiz1 > 3) &  (students_df.assignment > 7) ]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   pawar      5      5          10       2       4
4   5  pravin      5      5          10      22      34

In [169]:
students_df[ (students_df.quiz1 > 3) | (students_df.assignment > 7) ]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   pawar      5      5          10       2       4
3   4     abc      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [173]:
x = students_df[ ~(students_df.quiz1 > 3)]

In [175]:
type(x)

pandas.core.frame.DataFrame

In [179]:
students_df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   pawar      5      5          10       2       4
2   3     xyz      3      3           5      11      33
3   4     abc      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [181]:
x

   id name  quiz1  quiz2  assignment  midsem  compre
2   3  xyz      3      3           5      11      33

In [185]:
students_df.query('quiz1 > 3')

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   pawar      5      5          10       2       4
3   4     abc      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [85]:
y = df.query('quiz1 > 3 & quiz2 > 3')

In [86]:
type(y)

pandas.core.frame.DataFrame